tutorials/heatTransfer/chtMultiRegionFoam/coolingCylinder2D/constant/solid/thermophysicalProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      thermophysicalProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

thermoType
{
    type            heSolidThermo;
    mixture         pureMixture;
    transport       constIso;
    thermo          eConst;
    equationOfState rhoConst;
    specie          specie;
    energy          sensibleInternalEnergy;
}

mixture
{
    specie
    {
        nMoles      1;
        molWeight   63.5;   // [g/mol]
    }

    transport
    {
        kappa   380;        // [W/m/K]
    }

    thermodynamics
    {
        Hf      0;
        Cv      385;        // [J/kg/K]
    }

    equationOfState
    {
        rho     8940;       // [kg/m^3]
    }
}

// ************************************************************************* //
